{
    "github": {"msg": 
        {"enterUsername": "Enter the GitHub username of our partner (you can ask them to type it)"},
        "note": "opspark for %s: cli util to install, setup, and grade student projects"
    },
    "website": {"url": ["https://raw.githubusercontent.com/OperationSpark/first-website/master/.master/index.html", "https://raw.githubusercontent.com/OperationSpark/portfolio/master/.master/portfolio.html"]},
    "portfolio": {
        "filepath": "portfolio.html",
        "help": {
            "incomplete": "Whoops, we encountered a slight problem while trying to initialize your portfolio.html file:\n\nWe could not find your portfolio.html file. It should be located in the root directory of your website, and it should be called portfolio.html.\n\nIf you do not have a portfolio.html file in the root directory of your website, then you have not correctly completed the portfolio lesson of the Operation Spark website project, and you need to do so before moving forward.\n\nPlease complete the project tutorial at:\n\nhttps://github.com/OperationSpark/portfolio/blob/master/README.md\n\nIf you need help, please ask one of the Operation Spark instructors, or, ask for help on our Operation Spark Slack chat group.  If you are not a member of this group, please request an invitation by emailing:\n\nadmin@operationspark.org\n\nOnce you've sorted this out, try again to initialize your portfolio, thanks!",
            "noPortfolioList": "Whoops, we can't find an a <ul> with an id of portfolio.\n\nCheck your portfolio.html file, and ensure that you have appropriately given your portfolio <ul> the id of portfolio, so that the opening tag looks like <ul id=\"portfolio\">!\n\nOnce you do this, save your file and try again to initialize your portfolio, thanks!",
            "portfolioScriptTagExists": "Whoops, you are trying to initialize your portfolio.html file, but it appears the portfolio script tag already exists.\n\nDouble check your portfolio.html or ask for help."
        }
    },
    "pair": {
        "msg": {
            "enterPartnerName": "Enter the GitHub username of your partner (you can ask them to type it)"}
    },
    "userAgent": "opspark"
}